modmatic/arduino-boards/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# dotMG Cart (SAMD21E)
# --------------------------------------
dotmg_cart_samd21e.name=dotMG (SAMD21E Cart)

dotmg_cart_samd21e.vid.0=0x04D8
dotmg_cart_samd21e.pid.0=0xEC62
dotmg_cart_samd21e.build.vid=0x048D
dotmg_cart_samd21e.build.pid=0xEC62

dotmg_cart_samd21e.upload.tool=bossac
dotmg_cart_samd21e.upload.protocol=sam-ba
dotmg_cart_samd21e.upload.maximum_size=262144
dotmg_cart_samd21e.upload.use_1200bps_touch=true
dotmg_cart_samd21e.upload.wait_for_upload_port=true
dotmg_cart_samd21e.upload.native_usb=true

dotmg_cart_samd21e.build.mcu=cortex-m0plus
dotmg_cart_samd21e.build.f_cpu=48000000L
dotmg_cart_samd21e.build.usb_product="dotMG Cart (SAMD21E)"
dotmg_cart_samd21e.build.usb_manufacturer="Modmatic, LLC"
dotmg_cart_samd21e.build.board=DOTMG_CART_SAMD21E
dotmg_cart_samd21e.build.core=arduino
dotmg_cart_samd21e.build.extra_flags=-D__SAMD21E18A__ -DMODMATIC_DOTMG_CART_SAMD21E {build.usb_flags}
dotmg_cart_samd21e.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
dotmg_cart_samd21e.build.openocdscript=openocd_scripts/arduino_zero.cfg
dotmg_cart_samd21e.build.variant=dotmg_cart_samd21e
dotmg_cart_samd21e.build.variant_system_lib=

dotmg_cart_samd21e.bootloader.tool=openocd
dotmg_cart_samd21e.bootloader.file=zero/samd21_sam_ba.bin
